viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_jammer.cpp
    uint8_t version = f.read();
    if (version != NRF_JAM_CFG_VERSION) {
        f.close();
        return;
    }

    size_t expected = sizeof(NrfJamConfig) * NRF_JAM_MODE_COUNT;
    size_t bytesRead = f.read((uint8_t *)jamConfigs, expected);
    f.close();

    if (bytesRead != expected) return;

    // Clamp values
    for (int i = 0; i < NRF_JAM_MODE_COUNT; i++) {
        if (jamConfigs[i].paLevel > 3) jamConfigs[i].paLevel = 3;
        if (jamConfigs[i].dataRate > 2) jamConfigs[i].dataRate = 1;
        if (jamConfigs[i].dwellTimeMs > 200) jamConfigs[i].dwellTimeMs = 200;
        if (jamConfigs[i].useFlooding > 1) jamConfigs[i].useFlooding = 1;
    }
    Serial.println("[JAM] Configs loaded from flash");
}

static void saveJamConfigs() {
    File f = LittleFS.open(NRF_JAM_CFG_PATH, FILE_WRITE);
    if (!f) return;
    f.write(NRF_JAM_CFG_VERSION);
    f.write((uint8_t *)jamConfigs, sizeof(NrfJamConfig) * NRF_JAM_MODE_COUNT);
    f.close();
    Serial.println("[JAM] Configs saved to flash");
}

// ── Apply RF config to hardware ─────────────────────────────────
static void applyJamConfig(const NrfJamConfig &cfg, bool flooding) {
    rf24_pa_dbm_e paLevels[] = {RF24_PA_MIN, RF24_PA_LOW, RF24_PA_HIGH, RF24_PA_MAX};
    rf24_datarate_e dataRates[] = {RF24_1MBPS, RF24_2MBPS, RF24_250KBPS};

    NRFradio.setPALevel(paLevels[cfg.paLevel & 3]);

    if (!NRFradio.setDataRate(dataRates[cfg.dataRate <= 2 ? cfg.dataRate : 1])) {
        Serial.println("[JAM] Warning: setDataRate failed");
    }

    NRFradio.setAutoAck(false);
    NRFradio.setRetries(0, 0);
    NRFradio.disableCRC();

    if (flooding) {
        NRFradio.setPayloadSize(32);
        NRFradio.setAddressWidth(3);
        uint8_t txAddr[] = {0xE7, 0xE7, 0xE7};
        NRFradio.openWritingPipe(txAddr);
        NRFradio.stopListening();
    }
}

// ── Data flooding on a channel ──────────────────────────────────
// Safely switch channel (CE LOW → configure → CE HIGH) then burst.
static void floodChannel(uint8_t ch, uint16_t dwellMs) {
    // CE LOW to safely change channel mid-flight
    digitalWrite(bruceConfigPins.NRF24_bus.io0, LOW);
    NRFradio.flush_tx();
    NRFradio.setChannel(ch);

    if (dwellMs == 0) {
        // Turbo: fill FIFO (3 packets) and fire
        NRFradio.writeFast(JAM_FLOOD_DATA, 32, true);
        NRFradio.writeFast(JAM_FLOOD_DATA, 32, true);
        NRFradio.writeFast(JAM_FLOOD_DATA, 32, true);
        delayMicroseconds(500);
        return;
    }

    unsigned long startMs = millis();
    while ((millis() - startMs) < dwellMs) {
        if (!NRFradio.writeFast(JAM_FLOOD_DATA, 32, true)) { delayMicroseconds(10); }
    }
}

// ── CW initialization helper ────────────────────────────────────
// Must call powerUp() before startConstCarrier() because
// stopConstCarrier() → powerDown() clears the internal PWR_UP flag,
// and startConstCarrier() never restores it (RF24 library bug).
static void initCW(int channel) {
    NRFradio.powerUp();
    delay(5); // Tpd2stby: power-down → standby settle
    NRFradio.setPALevel(RF24_PA_MAX);
    NRFradio.startConstCarrier(RF24_PA_MAX, channel);
    NRFradio.setAddressWidth(5);
    NRFradio.setPayloadSize(2);
    NRFradio.setDataRate(RF24_2MBPS);
}

// ── CW on a channel ─────────────────────────────────────────────
// Carrier stays on — just move the frequency via setChannel().
// This matches the original jammer behavior: startConstCarrier once at
// init, then setChannel() to hop.  PLL re-locks in ~130µs, carrier
// is never fully off → maximum duty cycle.
static void cwChannel(uint8_t ch, uint16_t dwellMs) {
    NRFradio.setChannel(ch);

    if (dwellMs == 0) return;

    if (dwellMs <= 5) {
        delayMicroseconds((uint32_t)dwellMs * 1000);
    } else {
        delay(dwellMs);
    }
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ CONFIG EDIT UI ═══════════════════════════════
// ══════════════════════════════════════════════════════════════════

static void editModeConfig(NrfJamMode mode) {
    NrfJamConfig &cfg = jamConfigs[(uint8_t)mode];
    const char *paLabels[] = {"MIN (-18dBm)", "LOW (-12dBm)", "HIGH (-6dBm)", "MAX (0/+20dBm)"};
    const char *drLabels[] = {"1 Mbps", "2 Mbps", "250 Kbps"};
    const char *stratLabels[] = {"Constant Carrier", "Data Flooding"};

    int menuIdx = 0;
    bool editing = false;
    bool redraw = true;

    while (true) {
        if (check(EscPress)) {
            saveJamConfigs();
            break;
        }

        if (redraw) {
            drawMainBorderWithTitle(MODE_INFO[(uint8_t)mode].shortName);
            tft.setTextSize(FP);
            tft.setTextColor(bruceConfig.priColor, bruceConfig.bgColor);

            int y = BORDER_PAD_Y + FM * LH + 4;
            int lineH = max(14, tftHeight / 10);

            // Items
            const char *items[] = {"PA Level", "Data Rate", "Dwell (ms)", "Strategy", "Save & Back"};
            String values[] = {
                paLabels[cfg.paLevel & 3],
                drLabels[cfg.dataRate <= 2 ? cfg.dataRate : 1],
                String(cfg.dwellTimeMs),
                stratLabels[cfg.useFlooding & 1],
                ""
            };

            for (int i = 0; i < 5; i++) {
                int itemY = y + i * lineH;
                uint16_t fg = (i == menuIdx) ? bruceConfig.bgColor : bruceConfig.priColor;
                uint16_t bg = (i == menuIdx) ? bruceConfig.priColor : bruceConfig.bgColor;

                tft.fillRect(7, itemY, tftWidth - 14, lineH - 2, bg);
                tft.setTextColor(fg, bg);
                String line = String(items[i]);
                if (values[i].length() > 0) { line += ": " + values[i]; }
                tft.drawString(line, 12, itemY + 2, 1);

                if (editing && i == menuIdx && i < 4) {
                    tft.setTextColor(bruceConfig.bgColor, bg);
                    tft.drawRightString("<>", tftWidth - 12, itemY + 2, 1);
                }
            }
            redraw = false;
        }

        if (check(NextPress)) {
            if (editing) {
                switch (menuIdx) {
                    case 0: cfg.paLevel = (cfg.paLevel + 1) % 4; break;
                    case 1: cfg.dataRate = (cfg.dataRate + 1) % 3; break;
                    case 2: cfg.dwellTimeMs = min(200, (int)cfg.dwellTimeMs + 1); break;
                    case 3: cfg.useFlooding = !cfg.useFlooding; break;
                }
            } else {
                menuIdx = (menuIdx + 1) % 5;
            }
            redraw = true;
        }

        if (check(PrevPress)) {
            if (editing) {
                switch (menuIdx) {
                    case 0: cfg.paLevel = (cfg.paLevel + 3) % 4; break;
                    case 1: cfg.dataRate = (cfg.dataRate + 2) % 3; break;
                    case 2: cfg.dwellTimeMs = max(0, (int)cfg.dwellTimeMs - 1); break;
                    case 3: cfg.useFlooding = !cfg.useFlooding; break;
                }
            } else {
                menuIdx = (menuIdx + 4) % 5;
            }
            redraw = true;
        }

