viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_jammer.cpp
        if (check(SelPress)) {
            if (menuIdx == 4) {
                saveJamConfigs();
                break;
            }
            editing = !editing;
            redraw = true;
        }

        delay(50);
    }
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ JAMMER STATUS UI ═════════════════════════════
// ══════════════════════════════════════════════════════════════════

static void drawJammerStatus(NrfJamMode mode, int currentCh, uint8_t nrfOnline, bool initial) {
    const NrfJamConfig &cfg = jamConfigs[(uint8_t)mode];

    if (initial) { drawMainBorderWithTitle("NRF JAMMER"); }

    int y = BORDER_PAD_Y + FM * LH + 4;
    int lineH = max(14, tftHeight / 10);

    tft.setTextSize(FP);

    // Mode name
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    tft.setTextColor(TFT_GREEN, bruceConfig.bgColor);
    tft.drawString(MODE_INFO[(uint8_t)mode].shortName, 12, y + 2, 1);

    y += lineH;

    // Status
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    tft.setTextColor(bruceConfig.priColor, bruceConfig.bgColor);
    char buf[40];
    snprintf(buf, sizeof(buf), "Status: %d ACTIVE", nrfOnline);
    tft.drawString(buf, 12, y + 2, 1);

    y += lineH;

    // Channel / Frequency
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    tft.setTextColor(TFT_YELLOW, bruceConfig.bgColor);
    int freq = 2400 + currentCh;
    snprintf(buf, sizeof(buf), "CH:%d  %dMHz", currentCh, freq);
    tft.drawString(buf, 12, y + 2, 1);

    y += lineH;

    // Config summary
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    tft.setTextColor(TFT_DARKGREY, bruceConfig.bgColor);
    snprintf(buf, sizeof(buf), "%s dwell:%dms", cfg.useFlooding ? "FLOOD" : "CW", cfg.dwellTimeMs);
    tft.drawString(buf, 12, y + 2, 1);

    // Footer
    tft.setTextColor(TFT_DARKGREY, bruceConfig.bgColor);
    int footerY = tftHeight - BORDER_PAD_X - FP * LH - 2;
    tft.fillRect(7, footerY, tftWidth - 14, FP * LH, bruceConfig.bgColor);
    tft.drawCentreString("[ESC]Stop [<>]Mode [OK]Cfg", tftWidth / 2, footerY, 1);
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ JAMMER EXECUTION LOOP ════════════════════════
// ══════════════════════════════════════════════════════════════════

static void runJammer(NRF24_MODE nrfMode, NrfJamMode jamMode) {
    int OnX = 0;
    uint8_t NRFOnline = 1;
    uint8_t NRFSPI = 0;
    NrfJamMode currentMode = jamMode;
    int channel = 0;
    int hopIndex = 0;

    if (CHECK_NRF_SPI(nrfMode)) {
        NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
        bool flooding = cfg.useFlooding;

        if (flooding) {
            applyJamConfig(cfg, true);
        } else {
            initCW(channel);
        }
        NRFSPI = 1;
    }

    drawJammerStatus(currentMode, channel, NRFOnline, true);

    if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
        NRFSerial.println("RADIOS");
        vTaskDelay(50 / portTICK_PERIOD_MS);
    }

    bool running = true;
    bool redraw = false;

    while (running) {
        // ── Check for exit ──────────────────────────────────────
        if (check(EscPress)) {
            running = false;
            break;
        }

        // ── UART handling ───────────────────────────────────────
        if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
            if (OnX == 0) {
                NRFSerial.println("RADIOS");
                vTaskDelay(250 / portTICK_PERIOD_MS);
            }
            if (NRFSerial.available()) {
                String incomingNRFs = NRFSerial.readStringUntil('\n');
                incomingNRFs.trim();
                if (incomingNRFs.length() == 1 && isDigit(incomingNRFs.charAt(0))) {
                    OnX = 1;
                    NRFOnline = incomingNRFs.toInt();
                    if (CHECK_NRF_BOTH(nrfMode)) NRFOnline += NRFSPI;
                    redraw = true;
                }
            }
        }

        // ── Config: press SEL to edit mode config ───────────────
        if (check(SelPress)) {
            if (CHECK_NRF_SPI(nrfMode)) NRFradio.stopConstCarrier();
            editModeConfig(currentMode);

            // Re-apply config after edit — must use initCW() because
            // stopConstCarrier() → powerDown() clears internal PWR_UP,
            // and bare startConstCarrier() never restores it.
            if (CHECK_NRF_SPI(nrfMode)) {
                NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
                if (cfg.useFlooding) {
                    applyJamConfig(cfg, true);
                } else {
                    initCW(channel);
                }
            }
            redraw = true;
        }

        // ── Mode cycling: Next/Prev ─────────────────────────────
        if (check(NextPress)) {
            NrfJamMode prevMode = currentMode;
            currentMode = (NrfJamMode)(((uint8_t)currentMode + 1) % NRF_JAM_MODE_COUNT);
            hopIndex = 0;
            if (CHECK_NRF_SPI(nrfMode)) {
                NrfJamConfig &prevCfg = jamConfigs[(uint8_t)prevMode];
                NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
                if (prevCfg.useFlooding != cfg.useFlooding) {
                    NRFradio.stopConstCarrier();
                    if (cfg.useFlooding) {
                        applyJamConfig(cfg, true);
                    } else {
                        initCW(channel);
                    }
                }
            }
            if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
                NRFSerial.println(MODE_INFO[(uint8_t)currentMode].shortName);
            }
            redraw = true;
        }
        if (check(PrevPress)) {
            NrfJamMode prevMode = currentMode;
            currentMode = (NrfJamMode)(((uint8_t)currentMode + NRF_JAM_MODE_COUNT - 1) % NRF_JAM_MODE_COUNT);
            hopIndex = 0;
            if (CHECK_NRF_SPI(nrfMode)) {
                NrfJamConfig &prevCfg = jamConfigs[(uint8_t)prevMode];
                NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
                if (prevCfg.useFlooding != cfg.useFlooding) {
                    NRFradio.stopConstCarrier();
                    if (cfg.useFlooding) {
                        applyJamConfig(cfg, true);
                    } else {
                        initCW(channel);
                    }
                }
            }
            redraw = true;
        }

