viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_jammer.cpp
        // ── Redraw on state changes only (no periodic redraw) ───
        if (redraw) {
            drawJammerStatus(currentMode, channel, NRFOnline, true);
            redraw = false;
        }

        // ── Jamming logic (SPI mode) ────────────────────────────
        if (!CHECK_NRF_SPI(nrfMode)) {
            delay(10);
            continue;
        }

        NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
        bool flooding = cfg.useFlooding;
        uint16_t dwellMs = cfg.dwellTimeMs;

        switch (currentMode) {
            case NRF_JAM_FULL:
            case NRF_JAM_DRONE: {
                // Full sweep 0-124 (like original)
                if (flooding) floodChannel(hopIndex, dwellMs);
                else cwChannel(hopIndex, dwellMs);
                channel = hopIndex;
                hopIndex = (hopIndex + 1) % 125;
                break;
            }

            default: {
                // All preset channel list modes: sequential hopping
                // (BLE, BLE_ADV, WiFi, Bluetooth, USB, Video, RC, Zigbee)
                size_t count;
                const uint8_t *channels = getChannelList(currentMode, count);
                if (count > 0 && channels) {
                    uint8_t ch = channels[hopIndex % count];
                    if (flooding) floodChannel(ch, dwellMs);
                    else cwChannel(ch, dwellMs);
                    channel = ch;
                    hopIndex++;
                    if (hopIndex >= (int)count) hopIndex = 0;
                } else {
                    delay(1);
                }
                break;
            }
        }
    }

    // ── Cleanup ─────────────────────────────────────────────────
    if (CHECK_NRF_SPI(nrfMode)) {
        NRFradio.stopConstCarrier();
        NRFradio.flush_tx();
        NRFradio.powerDown();
    }
    if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) { NRFSerial.println("OFF"); }
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ PUBLIC ENTRY POINTS ══════════════════════════
// ══════════════════════════════════════════════════════════════════

void nrf_jammer() {
    loadJamConfigs();

    // Feature selection submenu (radio init deferred until needed)
    NrfJamMode selectedMode = NRF_JAM_FULL;
    int selectedAction = 0; // 0=none, 1=preset mode, 2=ch_jammer, 3=ch_hopper

    options.clear();
    for (int i = 0; i < NRF_JAM_MODE_COUNT; i++) {
        int mIdx = i;
        options.push_back({MODE_INFO[i].name, [&selectedMode, &selectedAction, mIdx]() {
                               selectedMode = (NrfJamMode)mIdx;
                               selectedAction = 1;
                           }});
    }
    options.push_back({"Single CH", [&selectedAction]() { selectedAction = 2; }});
    options.push_back({"CH Hopper", [&selectedAction]() { selectedAction = 3; }});
    options.push_back({"Reset Settings", [&selectedAction]() { selectedAction = 4; }});
    options.push_back({"Back", [=]() { returnToMenu = true; }});

    loopOptions(options, MENU_TYPE_SUBMENU, "NRF Jammer");

    if (returnToMenu || selectedAction == 0) return;

    // CH Jammer and CH Hopper handle their own radio init
    if (selectedAction == 2) {
        nrf_channel_jammer();
        return;
    }
    if (selectedAction == 3) {
        nrf_channel_hopper();
        return;
    }
    if (selectedAction == 4) {
        // Reset settings: delete config file and reload defaults
        if (LittleFS.exists(NRF_JAM_CFG_PATH)) { LittleFS.remove(NRF_JAM_CFG_PATH); }
        displaySuccess("Settings reset", true);
        return;
    }

    // Preset mode selected — init radio and run
    NRF24_MODE nrfMode = nrf_setMode();
    if (returnToMenu || nrfMode == NRF_MODE_DISABLED) return;

    if (!nrf_start(nrfMode)) {
        displayError("NRF24 not found");
        vTaskDelay(500 / portTICK_PERIOD_MS);
        return;
    }

    runJammer(nrfMode, selectedMode);
}

void nrf_channel_jammer() {
    int OnX = 0;
    NRF24_MODE mode = nrf_setMode();
    if (returnToMenu || mode == NRF_MODE_DISABLED) return;

    uint8_t NRFOnline = 1;
    uint8_t NRFSPI = 0;

    if (!nrf_start(mode)) {
        displayError("NRF24 not found");
        delay(500);
        return;
    }

    int channel = 50;
    bool redraw = true;
    bool paused = false;

    if (CHECK_NRF_SPI(mode)) {
        initCW(channel);
        NRFSPI = 1;
    }

    if (CHECK_NRF_UART(mode) || CHECK_NRF_BOTH(mode)) {
        NRFSerial.println("RADIOS");
        vTaskDelay(50 / portTICK_PERIOD_MS);
    }

    while (true) {
        if (check(EscPress)) break;

        if (CHECK_NRF_UART(mode) || CHECK_NRF_BOTH(mode)) {
            if (OnX == 0) {
                NRFSerial.println("RADIOS");
                vTaskDelay(250 / portTICK_PERIOD_MS);
            }
            if (NRFSerial.available()) {
                String incomingNRFs = NRFSerial.readStringUntil('\n');
                incomingNRFs.trim();
                if (incomingNRFs.length() == 1 && isDigit(incomingNRFs.charAt(0))) {
                    NRFOnline = incomingNRFs.toInt();
                    if (CHECK_NRF_BOTH(mode)) NRFOnline += NRFSPI;
                    redraw = true;
                    OnX = 1;
                }
            }
        }

        if (redraw) {
            drawMainBorderWithTitle("SINGLE CH JAMMER");

            int contentY = BORDER_PAD_Y + FM * LH + 4;
            int lineH = max(14, tftHeight / 10);
            int freq = 2400 + channel;

            tft.setTextSize(FP);

            // Status
            tft.setTextColor(TFT_GREEN, bruceConfig.bgColor);
            char buf[40];
            snprintf(buf, sizeof(buf), "STATUS: %d ACTIVE", NRFOnline);
            tft.drawCentreString(buf, tftWidth / 2, contentY, 1);
            contentY += lineH;

            // Channel / Frequency
            tft.setTextColor(TFT_YELLOW, bruceConfig.bgColor);
            snprintf(buf, sizeof(buf), "CH: %d  (%d MHz)", channel, freq);
            tft.drawCentreString(buf, tftWidth / 2, contentY, 1);
            contentY += lineH;

