viniciushnf/ESP32-S3-Bruce-ST7735-1.8/bruce-firmware/src/modules/NRF24/nrf_jammer.cpp
            // Pause state
            tft.setTextColor(paused ? TFT_RED : TFT_GREEN, bruceConfig.bgColor);
            tft.fillRect(7, contentY, tftWidth - 14, lineH, bruceConfig.bgColor);
            tft.drawCentreString(paused ? "PAUSED" : "JAMMING", tftWidth / 2, contentY, 1);

            // Footer
            int footerY = tftHeight - BORDER_PAD_X - FP * LH - 2;
            tft.fillRect(7, footerY, tftWidth - 14, FP * LH, bruceConfig.bgColor);
            tft.setTextColor(TFT_DARKGREY, bruceConfig.bgColor);
            tft.drawCentreString("[ESC]Exit [<>]CH [OK]Pause", tftWidth / 2, footerY, 1);

            if (CHECK_NRF_UART(mode) || CHECK_NRF_BOTH(mode)) { NRFSerial.println("CH_" + String(channel)); }
            redraw = false;
        }

        // SEL: pause/resume
        if (check(SelPress)) {
            paused = !paused;
            if (CHECK_NRF_SPI(mode)) {
                if (paused) {
                    NRFradio.stopConstCarrier();
                } else {
                    initCW(channel);
                }
            }
            redraw = true;
        }

        if (check(NextPress)) {
            channel++;
            if (channel > 125) channel = 0;
            if (CHECK_NRF_SPI(mode) && !paused) {
                NRFradio.setChannel(channel);
                NRFradio.startConstCarrier(RF24_PA_MAX, channel);
            }
            redraw = true;
        }
        if (check(PrevPress)) {
            channel--;
            if (channel < 0) channel = 125;
            if (CHECK_NRF_SPI(mode) && !paused) {
                NRFradio.setChannel(channel);
                NRFradio.startConstCarrier(RF24_PA_MAX, channel);
            }
            redraw = true;
        }
    }

    if (CHECK_NRF_SPI(mode)) NRFradio.stopConstCarrier();
    if (CHECK_NRF_UART(mode) || CHECK_NRF_BOTH(mode)) NRFSerial.println("OFF");
}

void nrf_channel_hopper() {
    loadJamConfigs();

    NRF24_MODE nrfMode = nrf_setMode();
    if (returnToMenu || nrfMode == NRF_MODE_DISABLED) return;

    if (!nrf_start(nrfMode)) {
        displayError("NRF24 not found");
        vTaskDelay(100 / portTICK_PERIOD_MS);
        return;
    }

    // ── Hopper config UI ────────────────────────────────────────
    NrfHopperConfig hopCfg = {0, 80, 2};
    int menuIndex = 0;
    bool editMode = false;
    bool redraw = true;

    vTaskDelay(350 / portTICK_PERIOD_MS);

    if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
        NRFSerial.println("RADIOS");
        vTaskDelay(100 / portTICK_PERIOD_MS);
    }

    while (true) {
        if (check(EscPress)) return;

        if (redraw) {
            drawMainBorderWithTitle("HOPPER CONFIG");
            tft.setTextSize(FP);
            tft.setTextColor(bruceConfig.priColor, bruceConfig.bgColor);

            int y = BORDER_PAD_Y + FM * LH + 4;
            int lineH = max(16, tftHeight / 8);

            const char *labels[] = {"Start CH", "Stop CH", "Step", "Start Jammer", "Exit"};
            int values[] = {hopCfg.startChannel, hopCfg.stopChannel, hopCfg.stepSize, -1, -1};

            for (int i = 0; i < 5; i++) {
                int itemY = y + i * lineH;
                uint16_t fg = (i == menuIndex) ? bruceConfig.bgColor : bruceConfig.priColor;
                uint16_t bg = (i == menuIndex) ? bruceConfig.priColor : bruceConfig.bgColor;

                tft.fillRect(7, itemY, tftWidth - 14, lineH - 2, bg);
                tft.setTextColor(fg, bg);

                char line[32];
                if (values[i] >= 0) {
                    int freq = 2400 + values[i];
                    snprintf(line, sizeof(line), "%s: %d (%dMHz)", labels[i], values[i], freq);
                } else {
                    snprintf(line, sizeof(line), "%s", labels[i]);
                }
                tft.drawString(line, 12, itemY + 2, 1);

                if (editMode && i == menuIndex && i < 3) {
                    tft.setTextColor(bruceConfig.bgColor, bg);
                    tft.drawRightString("<>", tftWidth - 12, itemY + 2, 1);
                }
            }
            redraw = false;
        }

        if (check(NextPress)) {
            if (editMode) {
                if (menuIndex == 0) hopCfg.startChannel = (hopCfg.startChannel + 1) % 126;
                if (menuIndex == 1) hopCfg.stopChannel = (hopCfg.stopChannel + 1) % 126;
                if (menuIndex == 2) hopCfg.stepSize = (hopCfg.stepSize % 10) + 1;
            } else {
                menuIndex = (menuIndex + 1) % 5;
            }
            redraw = true;
            vTaskDelay(100 / portTICK_PERIOD_MS);
        }

        if (check(PrevPress)) {
            if (editMode) {
                if (menuIndex == 0) hopCfg.startChannel = (hopCfg.startChannel + 125) % 126;
                if (menuIndex == 1) hopCfg.stopChannel = (hopCfg.stopChannel + 125) % 126;
                if (menuIndex == 2) hopCfg.stepSize = ((hopCfg.stepSize - 2 + 10) % 10) + 1;
            } else {
                menuIndex = (menuIndex + 4) % 5;
            }
            redraw = true;
            vTaskDelay(100 / portTICK_PERIOD_MS);
        }

        if (check(SelPress)) {
            if (menuIndex == 3) {
                // Start hopper jammer inline
                if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
                    NRFSerial.println(
                        "HOPPER_" + String(hopCfg.startChannel) + "_" + String(hopCfg.stopChannel) + "_" +
                        String(hopCfg.stepSize)
                    );
                }

                if (CHECK_NRF_SPI(nrfMode)) { initCW(hopCfg.startChannel); }

                int ch = hopCfg.startChannel;
                bool hopRedraw = true;

                drawMainBorderWithTitle("CH HOPPER");

                while (true) {
                    if (check(EscPress)) break;

                    if (hopRedraw) {
                        int contentY = BORDER_PAD_Y + FM * LH + 4;
                        int lineHop = max(14, tftHeight / 10);
                        tft.setTextSize(FP);

